{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/scratch/czr/hf_models/InternVL2-8B-lvlm",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": "^(language_model|mlp1)(?!.*(lm_head|output|emb|wte|shared)).*",
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}